/********************************************************************************
 * @copyright   Copyright (c)
 * @file        bsp_config.h
 * @author      ouqingfeng
 * @date        2026/06/25
 * @brief       底层公共头文件和宏定义，以及板级配置参数
 * @attention  注意事项--
 * @ChangeLogs
 *  Date             Author          Notes
 *  2026/06/25       ouqingfeng          First version
 ********************************************************************************/
#ifndef _BSP_CONFIG_H_
#define _BSP_CONFIG_H_
//---------------------------------文件包含---------------------------------------
#include "esp_err.h"
#include "esp_log.h"
#include "esp_attr.h"
#include "esp_system.h"
#include "sdkconfig.h"
//---------------------------------本文内宏变量定义--------------------------------
//---------------------------------本文内宏命令定义--------------------------------
//---------------------------------本文内数据结构定义------------------------------
//---------------------------------本文件内变量声明--------------------------------
//---------------------------------本文件内函数声明--------------------------------
#endif /*BSP_CONFIG_H_*/
