/***********************************************************************
 *
 * THIS IS UNPUBLISHED PROPRIETARY SOURCE CODE OF DALA, INC.
 * The copyright notice above does not evidence any actual or intended
 * publication of such source code.
 * (c) Copyright 2012-2025, DALA, All Rights Reserved.
 * http://www.dalacontroller.com/
 *
 * File: FIFO.c
 * Author: ouqingfeng
 * Description: 该文件实现了一个8位无符号整数的先进先出（FIFO）队列的相关操作。
 * Created on: 2025.07.02
 *********************************************************************/
//---------------------------------------文件包含---------------------------------------
#include "FIFO.h"
#include "string.h"
#include "stdio.h"
//---------------------------------------常量定义---------------------------------------
//-----------------------------------文件内部使用的宏------------------------------------
//--------------------------------文件内部使用的数据类型--------------------------------
//---------------------------------------全局变量---------------------------------------
//---------------------------------------本地变量---------------------------------------
//-------------------------------------局部函数原型-------------------------------------
//---------------------------------------类的实现---------------------------------------
//---------------------------------------全局函数---------------------------------------
/**********************************************************************************************************
 * @name          U8_FIFO_Init
 * @brief         初始化一个8位无符号整数的FIFO队列
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要初始化的FIFO队列
 * @param         FIFOBuff: 指向用于存储FIFO队列数据的缓冲区的指针
 * @param         Size: FIFO队列的最大容量
 * @return        1: 初始化成功；0: 输入参数无效，初始化失败
 **********************************************************************************************************/
uint8_t U8_FIFO_Init(struct U8_FIFO_S *fifo, uint8_t *FIFOBuff, uint16_t Size) // U8_FIFO初始化
{
    if (fifo == NULL || FIFOBuff == NULL || Size == 0)
    {
        return 0; // 输入参数无效，直接返回
    }
    else
    {
        fifo->Head = 0;         // 将队列的头置为0，表示队列从缓冲区的起始位置开始
        fifo->Size = 0;         // 队列当前存储的数据量初始化为0
        fifo->Tail = 0;         // 将队列的尾置为0，表示队列的尾部在缓冲区的起始位置
        fifo->pBUFF = FIFOBuff; // 将队列的数据缓冲区指针指向传入的缓冲区
        fifo->MaxSize = Size;   // 设置队列的最大容量
        return 1;               // 初始化成功
    }
}

/**********************************************************************************************************
 * @name          U8_FIFO_Reset
 * @brief         重置一个8位无符号整数的FIFO队列，将队列清空
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要重置的FIFO队列
 * @return        无
 **********************************************************************************************************/
void U8_FIFO_Reset(struct U8_FIFO_S *fifo) // U8_FIFO复位
{
    fifo->Head = 0; // 将队列的头置为0
    fifo->Size = 0; // 将队列当前存储的数据量置为0
    fifo->Tail = 0; // 将队列的尾置为0
}

/**********************************************************************************************************
 * @name          U8_FIFO_Write
 * @brief         向8位无符号整数的FIFO队列中写入一个数据
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要写入数据的FIFO队列
 * @param         Data: 要写入队列的8位无符号整数数据
 * @return        1: 写入成功；0: 队列已满，写入失败
 **********************************************************************************************************/
uint8_t U8_FIFO_Write(struct U8_FIFO_S *fifo, uint8_t Data) // 入队列
{
    // 检查队列是否已满
    if (fifo->Size >= fifo->MaxSize)
    {
        return 0; // 队列已满，写入失败
    }
    else
    {
        fifo->pBUFF[fifo->Tail] = Data;                                     // 将数据写入队列的尾部
        fifo->Tail = ((++fifo->Tail) < fifo->MaxSize) ? (fifo->Tail) : (0); // 尾向后移动一位，使用三目运算确保尾在缓冲区范围内循环
        fifo->Size++;                                                       // 队列当前存储的数据量加1
        return 1;                                                           // 写入成功
    }
}

/**********************************************************************************************************
 * @name          U8_FIFO_Write_Batch
 * @brief         向8位无符号整数的FIFO队列中批量写入数据
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要写入数据的FIFO队列
 * @param         Data: 指向要写入队列的数据数组的指针
 * @param         Size: 要写入的数据的数量
 * @return        已成功写入队列的数据数量
 **********************************************************************************************************/
uint16_t U8_FIFO_Write_Batch(struct U8_FIFO_S *fifo, uint8_t *Data, uint16_t Size) // 写入队列大量数据
{
    uint16_t i = 0;
    // 循环写入数据
    for (i = 0; i < Size; i++)
    {
        // 调用U8_FIFO_Write函数写入一个数据
        if (U8_FIFO_Write(fifo, *(Data + i)) == 0)
        {
            return i; // 若写入失败，返回已写入的数量
        }
        else
        {
            ;
        }
    }
    return i;
}

/**********************************************************************************************************
 * @name          U8_FIFO_Read
 * @brief         从8位无符号整数的FIFO队列中读取一个数据
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要读取数据的FIFO队列
 * @param         Data: 指向用于存储读取数据的变量的指针
 * @return        1: 读取成功；0: 队列为空，读取失败
 **********************************************************************************************************/
uint8_t U8_FIFO_Read(struct U8_FIFO_S *fifo, uint8_t *Data)
{
    // 检查队列是否为空
    if (fifo->Size == 0)
    {
        return 0;
    }
    else
    {
        *Data = fifo->pBUFF[fifo->Head];                                    // 从队列的头部读取数据
        fifo->Head = ((++fifo->Head) < fifo->MaxSize) ? (fifo->Head) : (0); // 头向后移动一位，使用三目运算确保头在缓冲区范围内循环
        fifo->Size--;                                                       // 队列当前存储的数据量减1
        return 1;
    }
}

/**********************************************************************************************************
 * @name          U8_FIFO_Read_Batch
 * @brief         从8位无符号整数的FIFO队列中批量读取数据
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要读取数据的FIFO队列
 * @param         Data: 指向用于存储读取数据的数组的指针
 * @param         Size: 要读取的数据的数量
 * @return        已成功从队列中读取的数据数量
 **********************************************************************************************************/
uint16_t U8_FIFO_Read_Batch(struct U8_FIFO_S *fifo, uint8_t *Data, uint16_t Size)
{
    uint16_t i = 0;
    // 循环读取数据
    for (i = 0; i < Size; i++)
    {
        // 调用U8_FIFO_Read函数读取一个数据
        if (U8_FIFO_Read(fifo, &Data[i]) == 0)
        {
            return i; // 若读取失败，返回已读取的数量
        }
        else
        {
            ;
        }
    }
    return i;
}

/**********************************************************************************************************
 * @name          U8_FIFO_Size
 * @brief         获取8位无符号整数的FIFO队列当前存储的数据量
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要查询的FIFO队列
 * @return        队列当前存储的数据量
 **********************************************************************************************************/
uint16_t U8_FIFO_Size(struct U8_FIFO_S *fifo)
{
    return fifo->Size;
}

/**********************************************************************************************************
 * @name          U8_FIFO_Load
 * @brief         获取8位无符号整数的FIFO队列的负载率，即当前存储数据量与最大容量的比值
 * @author        ouqingfeng
 * @date          2025/07/02
 * @version       v0.1
 * @param         fifo: 指向U8_FIFO_S结构体的指针，代表要查询的FIFO队列
 * @return        队列的负载率，范围从0.0到1.0
 **********************************************************************************************************/
float U8_FIFO_Load(struct U8_FIFO_S *fifo)
{
    return fifo->Load = (float)fifo->Size / (float)fifo->MaxSize;
}
//---------------------------------------局部函数---------------------------------------