/*********************************************
 * @copyright   Copyright (c)
 * @file        Global.c
 * @author      ouqingfeng
 * @date        2026/06/05
 * @brief
 * @attention  注意事项--
 * @ChangeLogs
 *  Date             Author          Notes
 *  2026/06/05       ouqingfeng          First version
 **********************************************/
//---------------------------------文件包含------------------------------------------------------
#include "Global.h"
#include "../Drivers/LED/LED.h"
//---------------------------------本文件内宏定义------------------------------------------------
//---------------------------------本文件内函数声明----------------------------------------------
//---------------------------------本文件内变量定义----------------------------------------------
//---------------------------------本文件内函数定义----------------------------------------------
LED_S led1 = {
    .mode = LED_MODE_OFF,
    .io.Port = NULL, // ESP32不使用端口寄存器，保持NULL
    .io.Pin = 48,    // GPIO48连接LED1
    .io.Polar = GPIO_POLAR_INVERT};

void GlobalInit(void)
{
    /* 全局系统初始化 */
    LED_Init(&led1, 1.0f, 50); // 初始化LED1，频率1Hz，占空比50%
}
